'''
Завдання 2
Розробіть систему управління замовленнями таксі.
Кожне замовлення має містити інформацію про
клієнта, адресу, тип автомобіля та вартість. Реалізуйте
методи для додавання нових замовлень, зміни адреси та
типу автомобіля, а також видалення замовлення.
Використайте інкапсуляцію для захисту вартості від
неправильних змін.
'''


class Taxi:

    '''Create and manage taxi`s orders'''

    _client: str
    _address: str
    _auto: str
    _price: int

    __orders: dict

    def __str__(self):
        return f'{self._client}: auto - {self._auto}, price - {self._price}'



