'''
Завдання
Користувач вводить з клавіатури набір чисел. Отримані
числа необхідно зберегти до списку (тип списку оберіть в залежності від поставленого нижче завдання). Після чого покажіть меню, в якому запропонуєте користувачеві набір пунктів:
1. Додати нове число до списку (якщо таке число існує у
списку, потрібно вивести повідомлення про це користувачеві без додавання числа).
2. Видалити усі входження числа зі списку (користувач вводить з клавіатури число для видалення)
3. Показати вміст списку (залежно від вибору користувача,
покажіть список з початку або з кінця)
4. Перевірити, чи є значення у списку
5. Замінити значення у списку (користувач визначає, чи
замінити тільки перше входження, чи всі)
Дія виконується залежно від вибору користувача, після
чого меню з’являється знову.
'''
