'''Завдання 2
Створіть імітаційну модель «Причал морських катерів».
Введіть таку інформацію:
1. Середній час між появою пасажирів на причалі у різний час доби;
2. Середній час між появою катерів на причалі у різний час доби;
3. Тип зупинки катера (кінцева або інша). Визначіть:
    1. Середній час перебування людини на зупинці;
    2. Достатній інтервал часу між приходами катерів, коли на зупинці не більше N людей одночасно;
    3. Кількість вільних місць у катері є випадковою величиною.
Вибір необхідних структур даних визначте самостійно.'''



