'''
Завдання 2
Створіть клас черги з пріоритетами для роботи із символьними значеннями.
Ви маєте створити реалізації для операцій над елементами черги:
■ IsEmpty — перевірка, чи черга пуста;
■ IsFull — перевірка черги на заповнення;
■ InsertWithPriority — додати елемент з пріоритетом у чергу;
■ PullHighestPriorityElement — видалення елемента з найвищим пріоритетом із черги;
■ Peek — повернення найбільшого за пріоритетом елемента. Зверніть увагу, що елемент не видаляється з черги;
■ Show — відображення на екрані всіх елементів черги. Показуючи елемент, також необхідно вказати і його пріоритет.
На старті додатка відобразіть меню, в якому користувач може вибрати необхідну операцію.
'''